In [1]:
import numpy as np
import pandas as pd

In [2]:
column_names = ['user_id', 'item_id', 'rating', 'timestamp']
df = pd.read_csv('u.data', sep='\t', names=column_names)

In [3]:
df.head()

   user_id  item_id  rating  timestamp
0        0       50       5  881250949
1        0      172       5  881250949
2        0      133       1  881250949
3      196      242       3  881250949
4      186      302       3  891717742

In [4]:
movie_titles = pd.read_csv("Movie_Id_Titles")
movie_titles.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [5]:
df = pd.merge(df,movie_titles,on='item_id')
df.head()

   user_id  item_id  rating  timestamp             title
0        0       50       5  881250949  Star Wars (1977)
1      290       50       5  880473582  Star Wars (1977)
2       79       50       4  891271545  Star Wars (1977)
3        2       50       5  888552084  Star Wars (1977)
4        8       50       5  879362124  Star Wars (1977)

In [6]:
df['title'] = df['title'].str.lower()
df['title'].head()

0    star wars (1977)
1    star wars (1977)
2    star wars (1977)
3    star wars (1977)
4    star wars (1977)
Name: title, dtype: object

In [7]:
df['title'] = df['title'].str[:-7]
df['title'].head()

0    star wars
1    star wars
2    star wars
3    star wars
4    star wars
Name: title, dtype: object

In [10]:
#dealing with the null values
df.isnull().sum(axis=0)

user_id      0
item_id      0
rating       0
timestamp    0
title        0
dtype: int64

In [9]:
df.to_csv('df.csv')